In [1]:
import pandas as pd
import seaborn as sns

In [2]:
df = sns.load_dataset('titanic')

In [3]:
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [4]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [6]:
set(df.embark_town)

{'Cherbourg', 'Queenstown', 'Southampton', nan}

In [7]:
df.embark_town = df.embark_town.split()[0]

AttributeError: 'Series' object has no attribute 'split'

In [17]:
df.embark_town.str.split('').str[1].head()

0    S
1    C
2    S
3    S
4    S
Name: embark_town, dtype: object

In [18]:
df.embark_town = df.embark_town.str.split('').str[1].head()

In [19]:
df.embark_town.head()

0    S
1    C
2    S
3    S
4    S
Name: embark_town, dtype: object

In [20]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,S,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,C,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,S,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,S,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,S,no,True